In [3]:
import pandas as pd

# Unnest using Json_normalise

In [4]:
# load in nested data
data = [
    {
        "state": "Florida",
        "shortname": "FL",
        "info": {"governor": "Rick Scott"},
        "counties": [
            {"name": "Dade", "population": 12345},
            {"name": "Broward", "population": 40000},
            {"name": "Palm Beach", "population": 60000},
        ],
    },
    {
        "state": "Ohio",
        "shortname": "OH",
        "info": {"governor": "John Kasich"},
        "counties": [
            {"name": "Summit", "population": 1234},
            {"name": "Cuyahoga", "population": 1337},
        ],
    },
]

In [5]:
data

[{'state': 'Florida',
  'shortname': 'FL',
  'info': {'governor': 'Rick Scott'},
  'counties': [{'name': 'Dade', 'population': 12345},
   {'name': 'Broward', 'population': 40000},
   {'name': 'Palm Beach', 'population': 60000}]},
 {'state': 'Ohio',
  'shortname': 'OH',
  'info': {'governor': 'John Kasich'},
  'counties': [{'name': 'Summit', 'population': 1234},
   {'name': 'Cuyahoga', 'population': 1337}]}]

In [50]:
type(data)

list

In [51]:
len(data)

2

Here we can see we have a json object with 2 objects in the list

In [52]:
for i in data:
    print(i.keys())

dict_keys(['state', 'shortname', 'info', 'counties'])
dict_keys(['state', 'shortname', 'info', 'counties'])

we can see that both objects in this list have same keys

In [14]:
df = pd.DataFrame(data)
df

,state,shortname,info,counties
0,Florida,FL,{'governor': 'Rick Scott'},"[{'name': 'Dade', 'population': 12345}, {'name..."
1,Ohio,OH,{'governor': 'John Kasich'},"[{'name': 'Summit', 'population': 1234}, {'nam..."

if we try to load the raw data into a dataframe we get a table with nested data

from this dataframe we can see that state and shortname are static values that remain the same ,the counties array is a a list json object with multiple key value pairs e.g. name and population are both 2 different key that we will have to flatten the info array info is a dict json object with one key called govenor,

In [38]:
pd.json_normalize(data = data, record_path = "counties", meta = ["state", "shortname", ['info','governor']])

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich

when using json_normlaise we put the the array with lists of dictsin inside the record path , the static column get put in a list of meta and the json dict  and it s keys gt put inside and seperate list insie that list

## new data array

In [68]:
data = [
    {"id": 1, "name": {"first": "Coleen", "last": "Volk"}},
    {"name": {"given": "Mark", "family": "Regner"}},
    {"id": 2, "name": "Faye Raker"},
]

In [69]:
len(data)
# we can see 3 objects insdie this json object

3

In [70]:
for i in data:
    print(i.keys()) # we can see the firstand 3rd object have same keys but the sencodn array only has 1 key

dict_keys(['id', 'name'])
dict_keys(['name'])
dict_keys(['id', 'name'])

In [71]:
pd.DataFrame(data) # from this we can see 2 column arrays id and name id is static and name is a json dict object no list but in the 3rd array name is static

    id                                   name
0  1.0    {'first': 'Coleen', 'last': 'Volk'}
1  NaN  {'given': 'Mark', 'family': 'Regner'}
2  2.0                             Faye Raker

In [74]:
pd.json_normalize(data = data,  meta = ["id" , ['name','first']]) # no lists so no need for record path

    id name.first name.last name.given name.family        name
0  1.0     Coleen      Volk        NaN         NaN         NaN
1  NaN        NaN       NaN       Mark      Regner         NaN
2  2.0        NaN       NaN        NaN         NaN  Faye Raker

In [75]:
## new data
data = [
    {
        "id": 1,
        "name": "Cole Volk",
        "fitness": {"height": 130, "weight": 60},
    },
    {"name": "Mark Reg", "fitness": {"height": 130, "weight": 60}},
    {
        "id": 2,
        "name": "Faye Raker",
        "fitness": {"height": 130, "weight": 60},
    },
]

In [77]:
pd.DataFrame(data)

    id        name                        fitness
0  1.0   Cole Volk  {'height': 130, 'weight': 60}
1  NaN    Mark Reg  {'height': 130, 'weight': 60}
2  2.0  Faye Raker  {'height': 130, 'weight': 60}

In [78]:
for i in data:
    print(i.keys())

dict_keys(['id', 'name', 'fitness'])
dict_keys(['name', 'fitness'])
dict_keys(['id', 'name', 'fitness'])

In [94]:
pd.json_normalize(data = data, meta = ["id" ,'name', ['fitness','weight']], max_level=1) # no list of dicts so no record path also , static columns get put iside first list of meta then dicts get put inside of anoher list

    id        name  fitness.height  fitness.weight
0  1.0   Cole Volk             130              60
1  NaN    Mark Reg             130              60
2  2.0  Faye Raker             130              60

In [96]:
data = [
    {
        "state": "Florida",
        "shortname": "FL",
        "info": {"governor": "Rick Scott"},
        "counties": [
            {"name": "Dade", "population": 12345},
            {"name": "Broward", "population": 40000},
            {"name": "Palm Beach", "population": 60000},
        ],
    },
    {
        "state": "Ohio",
        "shortname": "OH",
        "info": {"governor": "John Kasich"},
        "counties": [
            {"name": "Summit", "population": 1234},
            {"name": "Cuyahoga", "population": 1337},
        ],
    },
]

In [97]:
pd.DataFrame(data)

,state,shortname,info,counties
0,Florida,FL,{'governor': 'Rick Scott'},"[{'name': 'Dade', 'population': 12345}, {'name..."
1,Ohio,OH,{'governor': 'John Kasich'},"[{'name': 'Summit', 'population': 1234}, {'nam..."

In [100]:
pd.json_normalize(data,record_path='counties')

         name  population
0        Dade       12345
1     Broward       40000
2  Palm Beach       60000
3      Summit        1234
4    Cuyahoga        1337

### to just get the counties column in its seperate dataframe jsut use record path

In [104]:
pd.json_normalize(data, record_path='counties',meta = ['state','shortname']) # to get static column usee meta

         name  population    state shortname
0        Dade       12345  Florida        FL
1     Broward       40000  Florida        FL
2  Palm Beach       60000  Florida        FL
3      Summit        1234     Ohio        OH
4    Cuyahoga        1337     Ohio        OH

In [108]:
pd.json_normalize(data, 
                  record_path='counties',
                  meta = ['state','shortname', ['info','governor']]
                 ) 
# to get the json dict use a list inside the list wiht the key

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich

In [117]:
data = {
  "person": [
    {
      "name": "John Doe",
      "age": 30,
      "address": {
        "city": "New York",
        "state": "NY"
      }
    },
    {
      "name": "Ali A",
      "age": 26,
      "address": {
        "city": "Bristol",
        "state": "Avon"
      }
    }
  ]
}

data

{'person': [{'name': 'John Doe',
   'age': 30,
   'address': {'city': 'New York', 'state': 'NY'}},
  {'name': 'Ali A',
   'age': 26,
   'address': {'city': 'Bristol', 'state': 'Avon'}}]}

In [125]:
type(data['person'])

list

In [126]:
data['person']

[{'name': 'John Doe',
  'age': 30,
  'address': {'city': 'New York', 'state': 'NY'}},
 {'name': 'Ali A', 'age': 26, 'address': {'city': 'Bristol', 'state': 'Avon'}}]

In [127]:
for i in data['person']:
    print(i.keys())

dict_keys(['name', 'age', 'address'])
dict_keys(['name', 'age', 'address'])

In [124]:
len(data['person']) # 2 json objects in this ist name and age are static and adress is json dict

2

In [129]:
pd.DataFrame(data['person'])

       name  age                               address
0  John Doe   30   {'city': 'New York', 'state': 'NY'}
1     Ali A   26  {'city': 'Bristol', 'state': 'Avon'}

In [133]:
pd.json_normalize(data['person'],max_level=1)

       name  age address.city address.state
0  John Doe   30     New York            NY
1     Ali A   26      Bristol          Avon

In [135]:
data = {'records': [
    {'id': 1, 'items': ['apple', 'banana']},
    {'id': 2, 'items': ['orange']}
]}

data

{'records': [{'id': 1, 'items': ['apple', 'banana']},
  {'id': 2, 'items': ['orange']}]}

In [139]:
type(data['records'])

list

In [141]:
len(data['records']) # 2 objects

2

In [143]:
for i in data['records']:
    print(i.keys()) # 2 column arrays in this

dict_keys(['id', 'items'])
dict_keys(['id', 'items'])

In [146]:
pd.DataFrame(data['records']) # we can see items arrya column has the list inside

   id            items
0   1  [apple, banana]
1   2         [orange]

In [165]:
pd.json_normalize(data['records'],record_path='items',meta = 'id',record_prefix='Items.') # since the its just a plain list we adda. prefix

  Items.0 id
0   apple  1
1  banana  1
2  orange  2

In [163]:
# using explode
df = pd.DataFrame(data['records'])
df

   id            items
0   1  [apple, banana]
1   2         [orange]

In [166]:
df.explode('items') #thats another way

   id   items
0   1   apple
0   1  banana
1   2  orange

In [167]:
## more complex data 

data = {
  "products": [
    {
      "product_id": 1,
      "name": "Laptop",
      "price": 999.99,
      "specs": {
        "screen_size": 15.6,
        "processor": "Intel Core i7",
        "memory": {
          "ram": 16,
          "storage": "512GB SSD"
        }
      },
      "reviews": [
        {"rating": 5, "text": "Great laptop!"},
        {"rating": 4, "text": "Good value for money"}
      ]
    },
    {
      "product_id": 2,
      "name": "Smartphone",
      "price": 799.99,
      "specs": {
        "display": "OLED",
        "camera": "48MP"
      }
    }
  ]
}

In [168]:
data # from this we can see the main data is inside of products which is a list of json objects

{'products': [{'product_id': 1,
   'name': 'Laptop',
   'price': 999.99,
   'specs': {'screen_size': 15.6,
    'processor': 'Intel Core i7',
    'memory': {'ram': 16, 'storage': '512GB SSD'}},
   'reviews': [{'rating': 5, 'text': 'Great laptop!'},
    {'rating': 4, 'text': 'Good value for money'}]},
  {'product_id': 2,
   'name': 'Smartphone',
   'price': 799.99,
   'specs': {'display': 'OLED', 'camera': '48MP'}}]}

In [173]:
type(data)

dict

In [175]:
type(data['products'])

list

In [176]:
data['products']

[{'product_id': 1,
  'name': 'Laptop',
  'price': 999.99,
  'specs': {'screen_size': 15.6,
   'processor': 'Intel Core i7',
   'memory': {'ram': 16, 'storage': '512GB SSD'}},
  'reviews': [{'rating': 5, 'text': 'Great laptop!'},
   {'rating': 4, 'text': 'Good value for money'}]},
 {'product_id': 2,
  'name': 'Smartphone',
  'price': 799.99,
  'specs': {'display': 'OLED', 'camera': '48MP'}}]

In [178]:
len(data['products'])# 2 arrays inside this

2

In [181]:
pd.DataFrame(data['products']) # from this we can see product id and name and price are static specs in a json dict and reviews as a list o dicts

,product_id,name,price,specs,reviews
0,1,Laptop,999.99,"{'screen_size': 15.6, 'processor': 'Intel Core...","[{'rating': 5, 'text': 'Great laptop!'}, {'rat..."
1,2,Smartphone,799.99,"{'display': 'OLED', 'camera': '48MP'}",NaN

In [189]:
pd.json_normalize(data['products'],record_path='reviews')# this dont work as ony one record has reviews array the second arrya doesnt

KeyError: "Key 'reviews' not found. If specifying a record_path, all elements of data should have the path."

In [216]:
df =pd.json_normalize(data['products'],max_level=1)
df

,product_id,name,price,reviews,specs.screen_size,specs.processor,specs.memory,specs.display,specs.camera
0,1,Laptop,999.99,"[{'rating': 5, 'text': 'Great laptop!'}, {'rat...",15.6,Intel Core i7,"{'ram': 16, 'storage': '512GB SSD'}",NaN,NaN
1,2,Smartphone,799.99,NaN,NaN,NaN,NaN,OLED,48MP

In [219]:
df = pd.json_normalize(data['products'],max_level=2) # max level 2 allows to expand the memory storage array
df

,product_id,name,price,reviews,specs.screen_size,specs.processor,specs.memory.ram,specs.memory.storage,specs.display,specs.camera
0,1,Laptop,999.99,"[{'rating': 5, 'text': 'Great laptop!'}, {'rat...",15.6,Intel Core i7,16.0,512GB SSD,NaN,NaN
1,2,Smartphone,799.99,NaN,NaN,NaN,NaN,NaN,OLED,48MP

In [220]:
explode_df =df.explode('reviews')
explode_df

,product_id,name,price,reviews,specs.screen_size,specs.processor,specs.memory.ram,specs.memory.storage,specs.display,specs.camera
0,1,Laptop,999.99,"{'rating': 5, 'text': 'Great laptop!'}",15.6,Intel Core i7,16.0,512GB SSD,NaN,NaN
0,1,Laptop,999.99,"{'rating': 4, 'text': 'Good value for money'}",15.6,Intel Core i7,16.0,512GB SSD,NaN,NaN
1,2,Smartphone,799.99,NaN,NaN,NaN,NaN,NaN,OLED,48MP

## new data

In [240]:
data = {
  "orders": [
    {
      "order_id": 12345,
      "order_date": "2024-08-02T12:34:56Z",
      "customer": {
        "id": 9876,
        "name": "John Doe",
        "email": "johndoe@example.com",
        "address": {
          "street": "123 Main St",
          "city": "Anytown",
          "state": "CA",
          "zip": "12345"
        }
      },
      "shipping_address": {
        "name": "Jane Doe",
        "street": "456 Elm St",
        "city": "Othertown",
        "state": "NY",
        "zip": "67890"
      },
      "billing_address": {
        "street": "123 Main St",
        "city": "Anytown",
        "state": "CA",
        "zip": "12345"
      },
      "products": [
        {
          "product_id": 101,
          "name": "Laptop",
          "price": 999.99,
          "quantity": 1,
          "options": {
            "color": "silver",
            "storage": "512GB"
          }
        },
        {
          "product_id": 202,
          "name": "Headphones",
          "price": 199.99,
          "quantity": 2
        }
      ],
      "total_price": 1199.97,
      "shipping_method": "standard",
      "payment_method": "credit_card",
      "status": "shipped"
    }
  ]
}
data

{'orders': [{'order_id': 12345,
   'order_date': '2024-08-02T12:34:56Z',
   'customer': {'id': 9876,
    'name': 'John Doe',
    'email': 'johndoe@example.com',
    'address': {'street': '123 Main St',
     'city': 'Anytown',
     'state': 'CA',
     'zip': '12345'}},
   'shipping_address': {'name': 'Jane Doe',
    'street': '456 Elm St',
    'city': 'Othertown',
    'state': 'NY',
    'zip': '67890'},
   'billing_address': {'street': '123 Main St',
    'city': 'Anytown',
    'state': 'CA',
    'zip': '12345'},
   'products': [{'product_id': 101,
     'name': 'Laptop',
     'price': 999.99,
     'quantity': 1,
     'options': {'color': 'silver', 'storage': '512GB'}},
    {'product_id': 202, 'name': 'Headphones', 'price': 199.99, 'quantity': 2}],
   'total_price': 1199.97,
   'shipping_method': 'standard',
   'payment_method': 'credit_card',
   'status': 'shipped'}]}

In [243]:
type(data['orders'])

list

In [246]:
len(data['orders']) # only 1 order

1

In [249]:
pd.DataFrame(data['orders']) # products is array column

,order_id,order_date,customer,shipping_address,billing_address,products,total_price,shipping_method,payment_method,status
0,12345,2024-08-02T12:34:56Z,"{'id': 9876, 'name': 'John Doe', 'email': 'joh...","{'name': 'Jane Doe', 'street': '456 Elm St', '...","{'street': '123 Main St', 'city': 'Anytown', '...","[{'product_id': 101, 'name': 'Laptop', 'price'...",1199.97,standard,credit_card,shipped

In [254]:
pd.json_normalize(data['orders'],record_path='products') # this will give us everythin in the products list

   product_id        name   price  quantity options.color options.storage
0         101      Laptop  999.99         1        silver           512GB
1         202  Headphones  199.99         2           NaN             NaN

In [379]:
pd.set_option('display.max_columns', None)
pd.json_normalize(data['orders'],record_path='products', meta = ['order_id','order_date','total_price','shipping_method','payment_method','status',['customer','address','street'],['customer','address','city'],['customer','address','state'],['customer','address','zip'],['customer','id'],['customer','name'],['customer','email'],['shipping_address','name'],['shipping_address','street'],['shipping_address','city'],['shipping_address','state'],['shipping_address','zip'],['billing_address','street'],['billing_address','city'],['billing_address','state'],['billing_address','zip']],max_level=2)

,product_id,name,price,quantity,options.color,options.storage,order_id,order_date,total_price,shipping_method,payment_method,status,customer.address.street,customer.address.city,customer.address.state,customer.address.zip,customer.id,customer.name,customer.email,shipping_address.name,shipping_address.street,shipping_address.city,shipping_address.state,shipping_address.zip,billing_address.street,billing_address.city,billing_address.state,billing_address.zip
0,101,Laptop,999.99,1,silver,512GB,12345,2024-08-02T12:34:56Z,1199.97,standard,credit_card,shipped,123 Main St,Anytown,CA,12345,9876,John Doe,johndoe@example.com,Jane Doe,456 Elm St,Othertown,NY,67890,123 Main St,Anytown,CA,12345
1,202,Headphones,199.99,2,NaN,NaN,12345,2024-08-02T12:34:56Z,1199.97,standard,credit_card,shipped,123 Main St,Anytown,CA,12345,9876,John Doe,johndoe@example.com,Jane Doe,456 Elm St,Othertown,NY,67890,123 Main St,Anytown,CA,12345

In [272]:
data

{'orders': [{'order_id': 12345,
   'order_date': '2024-08-02T12:34:56Z',
   'customer': {'id': 9876,
    'name': 'John Doe',
    'email': 'johndoe@example.com',
    'address': {'street': '123 Main St',
     'city': 'Anytown',
     'state': 'CA',
     'zip': '12345'}},
   'shipping_address': {'name': 'Jane Doe',
    'street': '456 Elm St',
    'city': 'Othertown',
    'state': 'NY',
    'zip': '67890'},
   'billing_address': {'street': '123 Main St',
    'city': 'Anytown',
    'state': 'CA',
    'zip': '12345'},
   'products': [{'product_id': 101,
     'name': 'Laptop',
     'price': 999.99,
     'quantity': 1,
     'options': {'color': 'silver', 'storage': '512GB'}},
    {'product_id': 202, 'name': 'Headphones', 'price': 199.99, 'quantity': 2}],
   'total_price': 1199.97,
   'shipping_method': 'standard',
   'payment_method': 'credit_card',
   'status': 'shipped'}]}

In [380]:
import pandas as pd
import json

def normalize_json(data):
    """
    Normalizes a complex JSON object into a pandas DataFrame.

    Args:
        data: The JSON object to normalize.

    Returns:
        A pandas DataFrame containing the normalized data.
    """

    if isinstance(data, dict):
        data = list(data.values())[0]  # Extract the first value if it's a dictionary

    df = pd.DataFrame(data)

    # Identify columns with list values
    list_cols = [col for col in df.columns if isinstance(df[col][0], list)]

    # Determine record path and meta columns
    record_path = list_cols[0] if list_cols else None
    meta_cols = [col for col in df.columns if col not in list_cols]

    # Create nested meta columns
    nested_meta_cols = []
    for col in meta_cols:
        if isinstance(df[col][0], dict):
            for k, v in df[col][0].items():
                nested_meta_cols.append([col, k])

    # Combine meta columns and nested meta columns
    meta_cols.extend(nested_meta_cols)

    # Normalize the DataFrame
    if record_path:
        df = pd.json_normalize(data, record_path=record_path, meta=meta_cols)

    return df

In [383]:
df = normalize_json(data)
df

,product_id,name,price,quantity,options.color,options.storage,order_id,order_date,customer,shipping_address,billing_address,total_price,shipping_method,payment_method,status,customer.id,customer.name,customer.email,customer.address,shipping_address.name,shipping_address.street,shipping_address.city,shipping_address.state,shipping_address.zip,billing_address.street,billing_address.city,billing_address.state,billing_address.zip
0,101,Laptop,999.99,1,silver,512GB,12345,2024-08-02T12:34:56Z,"{'id': 9876, 'name': 'John Doe', 'email': 'joh...","{'name': 'Jane Doe', 'street': '456 Elm St', '...","{'street': '123 Main St', 'city': 'Anytown', '...",1199.97,standard,credit_card,shipped,9876,John Doe,johndoe@example.com,"{'street': '123 Main St', 'city': 'Anytown', '...",Jane Doe,456 Elm St,Othertown,NY,67890,123 Main St,Anytown,CA,12345
1,202,Headphones,199.99,2,NaN,NaN,12345,2024-08-02T12:34:56Z,"{'id': 9876, 'name': 'John Doe', 'email': 'joh...","{'name': 'Jane Doe', 'street': '456 Elm St', '...","{'street': '123 Main St', 'city': 'Anytown', '...",1199.97,standard,credit_card,shipped,9876,John Doe,johndoe@example.com,"{'street': '123 Main St', 'city': 'Anytown', '...",Jane Doe,456 Elm St,Othertown,NY,67890,123 Main St,Anytown,CA,12345

In [384]:
df.drop(['customer','shipping_address','billing_address'],axis =1)

,product_id,name,price,quantity,options.color,options.storage,order_id,order_date,total_price,shipping_method,payment_method,status,customer.id,customer.name,customer.email,customer.address,shipping_address.name,shipping_address.street,shipping_address.city,shipping_address.state,shipping_address.zip,billing_address.street,billing_address.city,billing_address.state,billing_address.zip
0,101,Laptop,999.99,1,silver,512GB,12345,2024-08-02T12:34:56Z,1199.97,standard,credit_card,shipped,9876,John Doe,johndoe@example.com,"{'street': '123 Main St', 'city': 'Anytown', '...",Jane Doe,456 Elm St,Othertown,NY,67890,123 Main St,Anytown,CA,12345
1,202,Headphones,199.99,2,NaN,NaN,12345,2024-08-02T12:34:56Z,1199.97,standard,credit_card,shipped,9876,John Doe,johndoe@example.com,"{'street': '123 Main St', 'city': 'Anytown', '...",Jane Doe,456 Elm St,Othertown,NY,67890,123 Main St,Anytown,CA,12345

In [361]:
import pandas as pd
import json

def normalize_json(data):
    """
    Normalizes a complex JSON object into a pandas DataFrame.

    Args:
        data: The JSON object to normalize.

    Returns:
        A list of columns containing the normalized data.
    """

    if isinstance(data, dict):
        data = list(data.values())[0]  # Extract the first value if it's a dictionary

    df = pd.DataFrame(data)

    # Identify columns with list values
    list_cols = [col for col in df.columns if isinstance(df[col][0], list)]

    # Determine record path and meta columns
    record_path = list_cols[0] if list_cols else None
    meta_cols = [col for col in df.columns if col not in list_cols]

    # Create nested meta columns
    nested_meta_cols = []
    for col in meta_cols:
        if isinstance(df[col][0], dict):
            for k, v in df[col][0].items():
                nested_meta_cols.append([col, k])

    # Combine meta columns and nested meta columns
    meta_cols.extend(nested_meta_cols)

    # Filter out unwanted fields dynamically
    unwanted_fields = {'customer', 'shipping_address', 'billing_address'}
    filtered_meta_cols = []
    for col in meta_cols:
        if isinstance(col, list):
            if col[0] not in unwanted_fields:
                filtered_meta_cols.append(col)
        else:
            if col not in unwanted_fields and not isinstance(df[col][0], dict):
                filtered_meta_cols.append(col)

    return filtered_meta_cols

In [362]:
normalize_json(data)

['order_id',
 'order_date',
 'total_price',
 'shipping_method',
 'payment_method',
 'status']

 # using spark explode outer

In [6]:
data = [
    {
        "state": "Florida",
        "shortname": "FL",
        "info": {"governor": "Rick Scott"},
        "counties": [
            {"name": "Dade", "population": 12345},
            {"name": "Broward", "population": 40000},
            {"name": "Palm Beach", "population": 60000},
        ],
    },
    {
        "state": "Ohio",
        "shortname": "OH",
        "info": {"governor": "John Kasich"},
        "counties": [
            {"name": "Summit", "population": 1234},
            {"name": "Cuyahoga", "population": 1337},
        ],
    },
]

In [7]:
# old way 
pd.json_normalize(data,record_path = 'counties',meta = ['state','shortname',['info','governor']])

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich

In [8]:
# using the pandas explode method
df=pd.DataFrame(data)
df

,state,shortname,info,counties
0,Florida,FL,{'governor': 'Rick Scott'},"[{'name': 'Dade', 'population': 12345}, {'name..."
1,Ohio,OH,{'governor': 'John Kasich'},"[{'name': 'Summit', 'population': 1234}, {'nam..."

In [9]:
new_df =df.explode('counties',ignore_index ='True') # explode to get each element in list object of coutnies to new record
new_df

,state,shortname,info,counties
0,Florida,FL,{'governor': 'Rick Scott'},"{'name': 'Dade', 'population': 12345}"
1,Florida,FL,{'governor': 'Rick Scott'},"{'name': 'Broward', 'population': 40000}"
2,Florida,FL,{'governor': 'Rick Scott'},"{'name': 'Palm Beach', 'population': 60000}"
3,Ohio,OH,{'governor': 'John Kasich'},"{'name': 'Summit', 'population': 1234}"
4,Ohio,OH,{'governor': 'John Kasich'},"{'name': 'Cuyahoga', 'population': 1337}"

In [10]:
new_data = new_df.to_dict('records') # convert back to json objsct list
new_data

[{'state': 'Florida',
  'shortname': 'FL',
  'info': {'governor': 'Rick Scott'},
  'counties': {'name': 'Dade', 'population': 12345}},
 {'state': 'Florida',
  'shortname': 'FL',
  'info': {'governor': 'Rick Scott'},
  'counties': {'name': 'Broward', 'population': 40000}},
 {'state': 'Florida',
  'shortname': 'FL',
  'info': {'governor': 'Rick Scott'},
  'counties': {'name': 'Palm Beach', 'population': 60000}},
 {'state': 'Ohio',
  'shortname': 'OH',
  'info': {'governor': 'John Kasich'},
  'counties': {'name': 'Summit', 'population': 1234}},
 {'state': 'Ohio',
  'shortname': 'OH',
  'info': {'governor': 'John Kasich'},
  'counties': {'name': 'Cuyahoga', 'population': 1337}}]

In [15]:
type(new_data)

list

In [16]:
pd.json_normalize(new_data, max_level =1)

     state shortname info.governor counties.name  counties.population
0  Florida        FL    Rick Scott          Dade                12345
1  Florida        FL    Rick Scott       Broward                40000
2  Florida        FL    Rick Scott    Palm Beach                60000
3     Ohio        OH   John Kasich        Summit                 1234
4     Ohio        OH   John Kasich      Cuyahoga                 1337

In [17]:
from pyspark.sql import SparkSession
spark = SparkSession.builder \
    .appName("unnest json into Spark DataFrame") \
    .getOrCreate()

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
24/08/03 13:20:53 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
24/08/03 13:20:53 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [18]:
from pyspark.sql.functions import *

In [19]:
df = spark.createDataFrame(data)
df.show()

24/08/03 13:21:05 ERROR Executor: Exception in task 0.0 in stage 0.0 (TID 0)/ 1]
org.apache.spark.api.python.PythonException: Traceback (most recent call last):
  File "/opt/anaconda3/envs/pyspark_env/lib/python3.12/site-packages/pyspark/python/lib/pyspark.zip/pyspark/worker.py", line 1100, in main
    raise PySparkRuntimeError(
pyspark.errors.exceptions.base.PySparkRuntimeError: [PYTHON_VERSION_MISMATCH] Python in worker has different version (3, 10) than that in driver 3.12, PySpark cannot run with different minor versions.
Please check environment variables PYSPARK_PYTHON and PYSPARK_DRIVER_PYTHON are correctly set.

	at org.apache.spark.api.python.BasePythonRunner$ReaderIterator.handlePythonException(PythonRunner.scala:572)
	at org.apache.spark.api.python.PythonRunner$$anon$3.read(PythonRunner.scala:784)
	at org.apache.spark.api.python.PythonRunner$$anon$3.read(PythonRunner.scala:766)
	at org.apache.spark.api.python.BasePythonRunner$ReaderIterator.hasNext(PythonRunner.scala:525)
	at org.apache.spark.InterruptibleIterator.hasNext(InterruptibleIterator.scala:37)
	at scala.collection.Iterator$$anon$11.hasNext(Iterator.scala:491)
	at scala.collection.Iterator$$anon$10.hasNext(Iterator.scala:460)
	at scala.collection.Iterator$$anon$10.hasNext(Iterator.scala:460)
	at org.apache.spark.sql.catalyst.expressions.GeneratedClass$GeneratedIteratorForCodegenStage1.processNext(Unknown Source)
	at org.apache.spark.sql.execution.BufferedRowIterator.hasNext(BufferedRowIterator.java:43)
	at org.apache.spark.sql.execution.WholeStageCodegenEvaluatorFactory$WholeStageCodegenPartitionEvaluator$$anon$1.hasNext(WholeStageCodegenEvaluatorFactory.scala:43)
	at org.apache.spark.sql.execution.SparkPlan.$anonfun$getByteArrayRdd$1(SparkPlan.scala:388)
	at org.apache.spark.rdd.RDD.$anonfun$mapPartitionsInternal$2(RDD.scala:893)
	at org.apache.spark.rdd.RDD.$anonfun$mapPartitionsInternal$2$adapted(RDD.scala:893)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:367)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:331)
	at org.apache.spark.scheduler.ResultTask.runTask(ResultTask.scala:93)
	at org.apache.spark.TaskContext.runTaskWithListeners(TaskContext.scala:166)
	at org.apache.spark.scheduler.Task.run(Task.scala:141)
	at org.apache.spark.executor.Executor$TaskRunner.$anonfun$run$4(Executor.scala:620)
	at org.apache.spark.util.SparkErrorUtils.tryWithSafeFinally(SparkErrorUtils.scala:64)
	at org.apache.spark.util.SparkErrorUtils.tryWithSafeFinally$(SparkErrorUtils.scala:61)
	at org.apache.spark.util.Utils$.tryWithSafeFinally(Utils.scala:94)
	at org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:623)
	at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1144)
	at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:642)
	at java.base/java.lang.Thread.run(Thread.java:1623)
24/08/03 13:21:05 WARN TaskSetManager: Lost task 0.0 in stage 0.0 (TID 0) (alis-air.broadband executor driver): org.apache.spark.api.python.PythonException: Traceback (most recent call last):
  File "/opt/anaconda3/envs/pyspark_env/lib/python3.12/site-packages/pyspark/python/lib/pyspark.zip/pyspark/worker.py", line 1100, in main
    raise PySparkRuntimeError(
pyspark.errors.exceptions.base.PySparkRuntimeError: [PYTHON_VERSION_MISMATCH] Python in worker has different version (3, 10) than that in driver 3.12, PySpark cannot run with different minor versions.
Please check environment variables PYSPARK_PYTHON and PYSPARK_DRIVER_PYTHON are correctly set.

	at org.apache.spark.api.python.BasePythonRunner$ReaderIterator.handlePythonException(PythonRunner.scala:572)
	at org.apache.spark.api.python.PythonRunner$$anon$3.read(PythonRunner.scala:784)
	at org.apache.spark.api.python.PythonRunner$$anon$3.read(PythonRunner.scala:766)
	at org.apache.spark.api.python.BasePythonRunner$ReaderIterator.hasNext(PythonRunner.scala:525)
	at org.apache.spark.InterruptibleIterator.hasNext(InterruptibleIterator.scala:37)
	at scala.collection.Iterator$$anon$11.hasNext(Iterator.scala:491)
	at scala.collection.Iterator$$anon$10.hasNext(Iterator.scala:460)
	at scala.collection.Iterator$$anon$10.hasNext(Iterator.scala:460)
	at org.apache.spark.sql.catalyst.expressions.GeneratedClass$GeneratedIteratorForCodegenStage1.processNext(Unknown Source)
	at org.apache.spark.sql.execution.BufferedRowIterator.hasNext(BufferedRowIterator.java:43)
	at org.apache.spark.sql.execution.WholeStageCodegenEvaluatorFactory$WholeStageCodegenPartitionEvaluator$$anon$1.hasNext(WholeStageCodegenEvaluatorFactory.scala:43)
	at org.apache.spark.sql.execution.SparkPlan.$anonfun$getByteArrayRdd$1(SparkPlan.scala:388)
	at org.apache.spark.rdd.RDD.$anonfun$mapPartitionsInternal$2(RDD.scala:893)
	at org.apache.spark.rdd.RDD.$anonfun$mapPartitionsInternal$2$adapted(RDD.scala:893)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:367)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:331)
	at org.apache.spark.scheduler.ResultTask.runTask(ResultTask.scala:93)
	at org.apache.spark.TaskContext.runTaskWithListeners(TaskContext.scala:166)
	at org.apache.spark.scheduler.Task.run(Task.scala:141)
	at org.apache.spark.executor.Executor$TaskRunner.$anonfun$run$4(Executor.scala:620)
	at org.apache.spark.util.SparkErrorUtils.tryWithSafeFinally(SparkErrorUtils.scala:64)
	at org.apache.spark.util.SparkErrorUtils.tryWithSafeFinally$(SparkErrorUtils.scala:61)
	at org.apache.spark.util.Utils$.tryWithSafeFinally(Utils.scala:94)
	at org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:623)
	at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1144)
	at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:642)
	at java.base/java.lang.Thread.run(Thread.java:1623)

24/08/03 13:21:05 ERROR TaskSetManager: Task 0 in stage 0.0 failed 1 times; aborting job
24/08/03 13:21:05 WARN GarbageCollectionMetrics: To enable non-built-in garbage collector(s) List(G1 Concurrent GC), users should configure it(them) to spark.eventLog.gcMetrics.youngGenerationGarbageCollectors or spark.eventLog.gcMetrics.oldGenerationGarbageCollectors

Py4JJavaError: An error occurred while calling o42.showString.
: org.apache.spark.SparkException: Job aborted due to stage failure: Task 0 in stage 0.0 failed 1 times, most recent failure: Lost task 0.0 in stage 0.0 (TID 0) (alis-air.broadband executor driver): org.apache.spark.api.python.PythonException: Traceback (most recent call last):
  File "/opt/anaconda3/envs/pyspark_env/lib/python3.12/site-packages/pyspark/python/lib/pyspark.zip/pyspark/worker.py", line 1100, in main
    raise PySparkRuntimeError(
pyspark.errors.exceptions.base.PySparkRuntimeError: [PYTHON_VERSION_MISMATCH] Python in worker has different version (3, 10) than that in driver 3.12, PySpark cannot run with different minor versions.
Please check environment variables PYSPARK_PYTHON and PYSPARK_DRIVER_PYTHON are correctly set.

	at org.apache.spark.api.python.BasePythonRunner$ReaderIterator.handlePythonException(PythonRunner.scala:572)
	at org.apache.spark.api.python.PythonRunner$$anon$3.read(PythonRunner.scala:784)
	at org.apache.spark.api.python.PythonRunner$$anon$3.read(PythonRunner.scala:766)
	at org.apache.spark.api.python.BasePythonRunner$ReaderIterator.hasNext(PythonRunner.scala:525)
	at org.apache.spark.InterruptibleIterator.hasNext(InterruptibleIterator.scala:37)
	at scala.collection.Iterator$$anon$11.hasNext(Iterator.scala:491)
	at scala.collection.Iterator$$anon$10.hasNext(Iterator.scala:460)
	at scala.collection.Iterator$$anon$10.hasNext(Iterator.scala:460)
	at org.apache.spark.sql.catalyst.expressions.GeneratedClass$GeneratedIteratorForCodegenStage1.processNext(Unknown Source)
	at org.apache.spark.sql.execution.BufferedRowIterator.hasNext(BufferedRowIterator.java:43)
	at org.apache.spark.sql.execution.WholeStageCodegenEvaluatorFactory$WholeStageCodegenPartitionEvaluator$$anon$1.hasNext(WholeStageCodegenEvaluatorFactory.scala:43)
	at org.apache.spark.sql.execution.SparkPlan.$anonfun$getByteArrayRdd$1(SparkPlan.scala:388)
	at org.apache.spark.rdd.RDD.$anonfun$mapPartitionsInternal$2(RDD.scala:893)
	at org.apache.spark.rdd.RDD.$anonfun$mapPartitionsInternal$2$adapted(RDD.scala:893)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:367)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:331)
	at org.apache.spark.scheduler.ResultTask.runTask(ResultTask.scala:93)
	at org.apache.spark.TaskContext.runTaskWithListeners(TaskContext.scala:166)
	at org.apache.spark.scheduler.Task.run(Task.scala:141)
	at org.apache.spark.executor.Executor$TaskRunner.$anonfun$run$4(Executor.scala:620)
	at org.apache.spark.util.SparkErrorUtils.tryWithSafeFinally(SparkErrorUtils.scala:64)
	at org.apache.spark.util.SparkErrorUtils.tryWithSafeFinally$(SparkErrorUtils.scala:61)
	at org.apache.spark.util.Utils$.tryWithSafeFinally(Utils.scala:94)
	at org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:623)
	at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1144)
	at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:642)
	at java.base/java.lang.Thread.run(Thread.java:1623)

Driver stacktrace:
	at org.apache.spark.scheduler.DAGScheduler.failJobAndIndependentStages(DAGScheduler.scala:2856)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$abortStage$2(DAGScheduler.scala:2792)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$abortStage$2$adapted(DAGScheduler.scala:2791)
	at scala.collection.mutable.ResizableArray.foreach(ResizableArray.scala:62)
	at scala.collection.mutable.ResizableArray.foreach$(ResizableArray.scala:55)
	at scala.collection.mutable.ArrayBuffer.foreach(ArrayBuffer.scala:49)
	at org.apache.spark.scheduler.DAGScheduler.abortStage(DAGScheduler.scala:2791)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$handleTaskSetFailed$1(DAGScheduler.scala:1247)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$handleTaskSetFailed$1$adapted(DAGScheduler.scala:1247)
	at scala.Option.foreach(Option.scala:407)
	at org.apache.spark.scheduler.DAGScheduler.handleTaskSetFailed(DAGScheduler.scala:1247)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.doOnReceive(DAGScheduler.scala:3060)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.onReceive(DAGScheduler.scala:2994)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.onReceive(DAGScheduler.scala:2983)
	at org.apache.spark.util.EventLoop$$anon$1.run(EventLoop.scala:49)
	at org.apache.spark.scheduler.DAGScheduler.runJob(DAGScheduler.scala:989)
	at org.apache.spark.SparkContext.runJob(SparkContext.scala:2398)
	at org.apache.spark.SparkContext.runJob(SparkContext.scala:2419)
	at org.apache.spark.SparkContext.runJob(SparkContext.scala:2438)
	at org.apache.spark.sql.execution.SparkPlan.executeTake(SparkPlan.scala:530)
	at org.apache.spark.sql.execution.SparkPlan.executeTake(SparkPlan.scala:483)
	at org.apache.spark.sql.execution.CollectLimitExec.executeCollect(limit.scala:61)
	at org.apache.spark.sql.Dataset.collectFromPlan(Dataset.scala:4332)
	at org.apache.spark.sql.Dataset.$anonfun$head$1(Dataset.scala:3314)
	at org.apache.spark.sql.Dataset.$anonfun$withAction$2(Dataset.scala:4322)
	at org.apache.spark.sql.execution.QueryExecution$.withInternalError(QueryExecution.scala:546)
	at org.apache.spark.sql.Dataset.$anonfun$withAction$1(Dataset.scala:4320)
	at org.apache.spark.sql.execution.SQLExecution$.$anonfun$withNewExecutionId$6(SQLExecution.scala:125)
	at org.apache.spark.sql.execution.SQLExecution$.withSQLConfPropagated(SQLExecution.scala:201)
	at org.apache.spark.sql.execution.SQLExecution$.$anonfun$withNewExecutionId$1(SQLExecution.scala:108)
	at org.apache.spark.sql.SparkSession.withActive(SparkSession.scala:900)
	at org.apache.spark.sql.execution.SQLExecution$.withNewExecutionId(SQLExecution.scala:66)
	at org.apache.spark.sql.Dataset.withAction(Dataset.scala:4320)
	at org.apache.spark.sql.Dataset.head(Dataset.scala:3314)
	at org.apache.spark.sql.Dataset.take(Dataset.scala:3537)
	at org.apache.spark.sql.Dataset.getRows(Dataset.scala:280)
	at org.apache.spark.sql.Dataset.showString(Dataset.scala:315)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke0(Native Method)
	at java.base/jdk.internal.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:75)
	at java.base/jdk.internal.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:52)
	at java.base/java.lang.reflect.Method.invoke(Method.java:578)
	at py4j.reflection.MethodInvoker.invoke(MethodInvoker.java:244)
	at py4j.reflection.ReflectionEngine.invoke(ReflectionEngine.java:374)
	at py4j.Gateway.invoke(Gateway.java:282)
	at py4j.commands.AbstractCommand.invokeMethod(AbstractCommand.java:132)
	at py4j.commands.CallCommand.execute(CallCommand.java:79)
	at py4j.ClientServerConnection.waitForCommands(ClientServerConnection.java:182)
	at py4j.ClientServerConnection.run(ClientServerConnection.java:106)
	at java.base/java.lang.Thread.run(Thread.java:1623)
Caused by: org.apache.spark.api.python.PythonException: Traceback (most recent call last):
  File "/opt/anaconda3/envs/pyspark_env/lib/python3.12/site-packages/pyspark/python/lib/pyspark.zip/pyspark/worker.py", line 1100, in main
    raise PySparkRuntimeError(
pyspark.errors.exceptions.base.PySparkRuntimeError: [PYTHON_VERSION_MISMATCH] Python in worker has different version (3, 10) than that in driver 3.12, PySpark cannot run with different minor versions.
Please check environment variables PYSPARK_PYTHON and PYSPARK_DRIVER_PYTHON are correctly set.

	at org.apache.spark.api.python.BasePythonRunner$ReaderIterator.handlePythonException(PythonRunner.scala:572)
	at org.apache.spark.api.python.PythonRunner$$anon$3.read(PythonRunner.scala:784)
	at org.apache.spark.api.python.PythonRunner$$anon$3.read(PythonRunner.scala:766)
	at org.apache.spark.api.python.BasePythonRunner$ReaderIterator.hasNext(PythonRunner.scala:525)
	at org.apache.spark.InterruptibleIterator.hasNext(InterruptibleIterator.scala:37)
	at scala.collection.Iterator$$anon$11.hasNext(Iterator.scala:491)
	at scala.collection.Iterator$$anon$10.hasNext(Iterator.scala:460)
	at scala.collection.Iterator$$anon$10.hasNext(Iterator.scala:460)
	at org.apache.spark.sql.catalyst.expressions.GeneratedClass$GeneratedIteratorForCodegenStage1.processNext(Unknown Source)
	at org.apache.spark.sql.execution.BufferedRowIterator.hasNext(BufferedRowIterator.java:43)
	at org.apache.spark.sql.execution.WholeStageCodegenEvaluatorFactory$WholeStageCodegenPartitionEvaluator$$anon$1.hasNext(WholeStageCodegenEvaluatorFactory.scala:43)
	at org.apache.spark.sql.execution.SparkPlan.$anonfun$getByteArrayRdd$1(SparkPlan.scala:388)
	at org.apache.spark.rdd.RDD.$anonfun$mapPartitionsInternal$2(RDD.scala:893)
	at org.apache.spark.rdd.RDD.$anonfun$mapPartitionsInternal$2$adapted(RDD.scala:893)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:367)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:331)
	at org.apache.spark.scheduler.ResultTask.runTask(ResultTask.scala:93)
	at org.apache.spark.TaskContext.runTaskWithListeners(TaskContext.scala:166)
	at org.apache.spark.scheduler.Task.run(Task.scala:141)
	at org.apache.spark.executor.Executor$TaskRunner.$anonfun$run$4(Executor.scala:620)
	at org.apache.spark.util.SparkErrorUtils.tryWithSafeFinally(SparkErrorUtils.scala:64)
	at org.apache.spark.util.SparkErrorUtils.tryWithSafeFinally$(SparkErrorUtils.scala:61)
	at org.apache.spark.util.Utils$.tryWithSafeFinally(Utils.scala:94)
	at org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:623)
	at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1144)
	at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:642)
	... 1 more

In [20]:
import os
import sys

os.environ['PYSPARK_PYTHON'] = sys.executable
os.environ['PYSPARK_DRIVER_PYTHON'] = sys.executable

In [21]:
data

[{'state': 'Florida',
  'shortname': 'FL',
  'info': {'governor': 'Rick Scott'},
  'counties': [{'name': 'Dade', 'population': 12345},
   {'name': 'Broward', 'population': 40000},
   {'name': 'Palm Beach', 'population': 60000}]},
 {'state': 'Ohio',
  'shortname': 'OH',
  'info': {'governor': 'John Kasich'},
  'counties': [{'name': 'Summit', 'population': 1234},
   {'name': 'Cuyahoga', 'population': 1337}]}]

# flatten json data using normalsie

In [64]:
raw_data = {
    "c_DATA": [
      {
        "guid": "1a2b3c4d5e",
        "name": "John Doe",
        "age": "30",
        "c_action": {
          "guid": "a1b2c3d4e5",
          "action_type": "click",
          "timestamp": "2023-06-01T12:34:56Z"
        },
        "emails": {
          "guid": "f1g2h3i4j5",
          "email_address": "john.doe@example.com",
          "verified": "true"
        },
        "s_posts": {
          "guid": "k1l2m3n4o5",
          "post_content": "Hello World",
          "post_date": "2023-06-01"
        },
        "land_page": {
          "guid": "p1q2r3s4t5",
          "page_url": "http://example.com",
          "visit_duration": "5 minutes"
        },
        "form": {
          "guid": "u1v2w3x4y5",
          "form_name": "Contact Us",
          "submission_date": "2023-06-01"
        },
        "trsource": {
          "guid": "z1a2b3c4d5",
          "source_type": "referral",
          "source_detail": "google.com"
        }
      },
      {
        "guid": "6f7g8h9i0j",
        "name": "Jane Smith",
        "age": "25",
        "c_action": {
          "guid": "b1c2d3e4f5",
          "action_type": "view",
          "timestamp": "2023-06-02T14:22:33Z"
        },
        "emails": {
          "guid": "g1h2i3j4k5",
          "email_address": "jane.smith@example.com",
          "verified": "false"
        },
        "s_posts": {
          "guid": "l1m2n3o4p5",
          "post_content": "Goodbye World",
          "post_date": "2023-06-02"
        },
        "land_page": {
          "guid": "q1r2s3t4u5",
          "page_url": "http://example.org",
          "visit_duration": "10 minutes"
        },
        "form": {
          "guid": "v1w2x3y4z5",
          "form_name": "Sign Up",
          "submission_date": "2023-06-02"
        },
        "trsource": {
          "guid": "a2b3c4d5e6",
          "source_type": "direct",
          "source_detail": "example.com"
        }
      }
    ],
    "other_array1": [
      {
        "field1": "value1",
        "field2": "value2"
      },
      {
        "field1": "value3",
        "field2": "value4"
      }
    ],
    "other_array2": [
      {
        "field1": "value5",
        "field2": "value6"
      },
      {
        "field1": "value7",
        "field2": "value8"
      }
    ],
    "other_array3": [
      {
        "field1": "value9",
        "field2": "value10"
      },
      {
        "field1": "value11",
        "field2": "value12"
      }
    ]
  }

In [65]:
data = raw_data['c_DATA']
print(type(data))
print(len(data))

<class 'list'>
2

In [66]:
df = pd.DataFrame(data)
df # so we can see inside of c_data there are no actual list of json objects iside just regualr lists

,guid,name,age,c_action,emails,s_posts,land_page,form,trsource
0,1a2b3c4d5e,John Doe,30,"{'guid': 'a1b2c3d4e5', 'action_type': 'click',...","{'guid': 'f1g2h3i4j5', 'email_address': 'john....","{'guid': 'k1l2m3n4o5', 'post_content': 'Hello ...","{'guid': 'p1q2r3s4t5', 'page_url': 'http://exa...","{'guid': 'u1v2w3x4y5', 'form_name': 'Contact U...","{'guid': 'z1a2b3c4d5', 'source_type': 'referra..."
1,6f7g8h9i0j,Jane Smith,25,"{'guid': 'b1c2d3e4f5', 'action_type': 'view', ...","{'guid': 'g1h2i3j4k5', 'email_address': 'jane....","{'guid': 'l1m2n3o4p5', 'post_content': 'Goodby...","{'guid': 'q1r2s3t4u5', 'page_url': 'http://exa...","{'guid': 'v1w2x3y4z5', 'form_name': 'Sign Up',...","{'guid': 'a2b3c4d5e6', 'source_type': 'direct'..."

In [72]:
# making a function that does it in a loop 
def flatten_and_write_each_array(data, array_column_name):
    # read json data into datafram 
    df = pd.DataFrame(data)
    array_column = array_column_name
  # get static columns
    static_column = ['guid','name','age']
  # Combine the columns
    columns = [array_column] + static_column
  # get each array column as its own dataframe with the static columns
    df_array_column = df[columns]
  # convert back to json
    array_column_data = df_array_column.to_dict('records')
  # flatten the array column
    df_array_column_flattened  = pd.json_normalize(array_column_data)
  # write to csv
    df_array_column_flattened.to_csv(f'Unnest_json/{array_column_name}.csv')
    
    return df_array_column_flattened

In [73]:
flatten_and_write_each_array(data, 'c_action')

,guid,name,age,c_action.guid,c_action.action_type,c_action.timestamp
0,1a2b3c4d5e,John Doe,30,a1b2c3d4e5,click,2023-06-01T12:34:56Z
1,6f7g8h9i0j,Jane Smith,25,b1c2d3e4f5,view,2023-06-02T14:22:33Z

In [74]:
# run it in a for each loop 
array_columns = ['emails','s_posts','land_page','form','trsource','c_action']
for array_column in array_columns:
    flatten_and_write_each_array(data,array_column)

# doing it the slicer json way

In [77]:
def extract_nested_data(data, key):
    extracted_data = []
    for item in data:
        if key in item:
            extracted_data.append(item[key])
            
        df = pd.DataFrame(extracted_data)
        df.to_csv(f'Unnest_json/{key}.csv')

    return pd.DataFrame(extracted_data)

In [78]:
array_columns = ['emails','s_posts','land_page','form','trsource','c_action']
for array_column in array_columns:
    extract_nested_data(data,array_column)